app/controllers/home_controller.rb

 def index
  	@students = Student.order(created_at: :desc).all
    @courses = Course.all
---
SELECT "students".* FROM "students" ORDER BY "students"."created_at" DESC
SELECT "courses".* FROM "courses"

  def aj
 	@courses = Course.all
---
SELECT "courses".* FROM "courses"

 def act
 	@students = Student.order(created_at: :desc).all
---
SELECT "students".* FROM "students" ORDER BY "students"."created_at" DESC