app/controllers/students_controller.rb

def create
	Student.create(stud_params)
---
INSERT INTO "students" ("name", "dob", "phone", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Jasmeet"], ["dob", "1995-05-05"], ["phone", "9985623145"], ["course_id", 1], ["created_at", "2017-12-21 10:43:49.930159"], ["updated_at", "2017-12-21 10:43:49.930159"]]

 def searchh
@stud =  Student.search(params[:search_string])
render json: @stud, status: :ok and return
@courses = Course.all
---
SELECT "students".* FROM "students" WHERE (name LIKE '%%' OR phone LIKE '%%')
SELECT "courses".* FROM "courses"

 def searchp
 	@stud =  Student.searchp(params[:search_string])
 	render json: @stud, status: :ok and return
    @courses = Course.all
---
SELECT "courses".* FROM "courses"

 def searchc
 	@stud =  Student.searchc(params[:search_string])
 	render json: @stud, status: :ok and return
    @courses = Course.all
---
SELECT "courses".* FROM "courses"